tap "homebrew/bundle"
tap "mhaeuser/mhaeuser"
tap "ngrok/ngrok"
tap "steipete/tap"
# Run your GitHub Actions locally
brew "act"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Load/unload environment variables based on $PWD
brew "direnv"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU grep, egrep and fgrep
brew "grep"
# Client library for huggingface.co hub
brew "hf"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Sophisticated file transfer program
brew "lftp"
# Lightweight Open Sound Control implementation
brew "liblo"
# LLVM's OpenMP runtime library
brew "libomp"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Swiss-army knife of markup format conversion
brew "pandoc"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Cross-platform library for audio I/O
brew "portaudio"
# Object-relational database system
brew "postgresql@18"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Version control system designed to be a better CVS
brew "subversion"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Tools for building Android applications
cask "android-studio"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Control the platform power state of your Apple Silicon device
cask "mhaeuser/mhaeuser/battery-toolkit"
# E-books management software
cask "calibre"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Productivity platform for tasks, docs, goals, and chat
cask "clickup"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie-desktop"
# Vector graphics editor
cask "inkscape"
# Download manager
cask "jdownloader"
# Keyboard customiser
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-wallet"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok/ngrok/ngrok"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Sound and audio controller
cask "proxy-audio-device"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Free Dj app to prepare and manage your music files
cask "rekordbox"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# File sharing network
cask "soulseek"
# Music streaming service
cask "spotify"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Open-source BitTorrent client
cask "transmission"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Keyboard configurator
cask "via"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Simple menu bar app to download YouTube movies
cask "youtube-downloader"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "Flow", id: 1423210932
mas "Ghostery Privacy Ad Blocker", id: 6504861501
mas "iMovie", id: 408981434
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDFgear", id: 6469021132
mas "Xcode", id: 497799835
vscode "christian-kohler.path-intellisense"
vscode "docker.docker"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "marimo-team.vscode-marimo"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "tomoki1207.pdf"
