tap "homebrew/bundle"

brew "coreutils"
brew "direnv"
brew "ffmpeg"
brew "git"
brew "grep"
brew "httpie"
brew "jq"
brew "mackup"
brew "mas"
brew "node"
brew "pkgconf"
brew "pnpm"
brew "subversion"
brew "uv"

cask "anki"
cask "appcleaner"
cask "bambu-studio"
cask "calibre"
cask "chatgpt"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "github"
cask "google-chrome"
cask "httpie"
cask "inkscape"
cask "jdownloader"
cask "ledger-live"
cask "nordvpn"
cask "ollama"
cask "postman"
cask "quicklook-json"
cask "rectangle"
cask "rekordbox"
cask "signal"
cask "slack"
cask "soulseek"
cask "spotify"
cask "tableplus"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
cask "transmit"
cask "tunnelblick"
cask "tuple"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "zotero"

vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "openai.openai-chatgpt-adhoc"
