tap "homebrew/bundle"
brew "coreutils"
brew "cowsay"
brew "direnv"
brew "ffmpeg"
brew "git"
brew "git-filter-repo"
brew "grep"
brew "httpie"
brew "jq"
brew "liblo"
brew "libomp"
brew "mackup"
brew "mas"
brew "node"
brew "pkgconf"
brew "platformio"
brew "pnpm"
brew "portaudio"
brew "rclone"
brew "speedtest-cli"
brew "subversion"
brew "tree"
brew "uv"
brew "wget"
cask "adobe-acrobat-reader"
cask "anki"
cask "appcleaner"
cask "calibre"
cask "chatgpt"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "github"
cask "google-chrome"
cask "httpie"
cask "inkscape"
cask "jdownloader"
cask "keepingyouawake"
cask "ledger-live"
cask "miniforge"
cask "nordvpn"
cask "ollama"
cask "postman"
cask "proxy-audio-device"
cask "quicklook-json"
cask "rectangle"
cask "rekordbox"
cask "signal"
cask "skype"
cask "slack"
cask "soulseek"
cask "spotify"
cask "tableplus"
cask "teamviewer"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
cask "tuple"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "zotero"
mas "Accelerate", id: 1459809092
mas "Flow", id: 1423210932
mas "Ghostery Privacy Ad Blocker", id: 6504861501
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "christian-kohler.path-intellisense"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "openai.openai-chatgpt-adhoc"
